---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.ReferenceLine
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.ReferenceLine

Creates a reference line that you can use when creating a new family, or to create constraints for the family.